#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		ДобавитьГруппуСкидкаВГруппаШапкаЛево(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппуСкидка(Форма);  
		ДобавитьКнопкуИКомандуПрименитьСкидкуВГруппуСкидка(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровИУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) 
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	КонецЕсли;
	
	
КонецПроцедуры     

#КонецОбласти   

#Область СлужебныйПрограммныйИнтерфейс    

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) 
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;  
	ПолеВвода.Заголовок = "Контактное лицо:";
	ПолеВвода.ПутьКДанным = "Объект.ДГА_КонтактноеЛицо"
	
КонецПроцедуры 

Процедура ДобавитьГруппуСкидкаВГруппаШапкаЛево(Форма)    
	
   	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппуСкидка(Форма) 

	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Согласованная скидка";
	ПолеВвода.ПутьКДанным = "Объект.ДГА_СогласованнаяСкидка";
	ПолеВвода.МинимальноеЗначение = 0;
	ПолеВвода.МаксимальноеЗначение = 100;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДГА_СогласованнаяСкидкаПриИзмененииПосле");
	
	
КонецПроцедуры  

Процедура ДобавитьКнопкуИКомандуПрименитьСкидкуВГруппуСкидка(Форма) 
	
	НоваяКоманда = Форма.Команды.Добавить("ОбщаяКоманда");
	НоваяКоманда.Заголовок = "Общая команда";
	НоваяКоманда.Действие = "ДГА_ПрименитьСкидку"; 
	НовыйЭлемент = Форма.Элементы.Добавить("ПрименитьСкидку", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	НовыйЭлемент.Заголовок = "Применить скидку";
	НовыйЭлемент.ИмяКоманды = "ОбщаяКоманда";
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДГА_КонтактноеЛицо"
	
КонецПроцедуры 
#КонецОбласти

